In [1]:
import pandas as pd

In [6]:
df1 = pd.DataFrame([(1,2),(3,4),(5,6)], columns=['a','b'])

df1

In [7]:
df1

   a  b
0  1  2
1  3  4
2  5  6

In [9]:
df1.set_index('a', inplace=True)

In [10]:
df1

   b
a
1  2
3  4
5  6

In [11]:
df2 = pd.DataFrame([(2,3),(4,5),(6,7)], columns=['a','b'])

In [12]:
df2.set_index('a', inplace=True)

In [13]:
df2

   b
a
2  3
4  5
6  7

In [14]:
df1.add(df2, fill_value=0)

     b
a
1  2.0
2  3.0
3  4.0
4  5.0
5  6.0
6  7.0

In [15]:
df1+df2

    b
a
1 NaN
2 NaN
3 NaN
4 NaN
5 NaN
6 NaN

In [16]:
df3 = pd.DataFrame([(1,3),(2,5),(3,7)], columns=['a','b'])

In [17]:
df3.set_index('a', inplace=True)

In [18]:
df3

   b
a
1  3
2  5
3  7

In [19]:
df1+df3

      b
a
1   5.0
2   NaN
3  11.0
5   NaN

In [20]:
df4 = pd.DataFrame([(1,2),(2,4),(3,6)], columns=['a','b'])

In [21]:
df4.set_index('a', inplace=True)

In [23]:
df3+df4

    b
a
1   5
2   9
3  13